[
    {
        "A": [
            {
                "idiom": "above board",
                "meaning": "If something is above board, it's been done in a legal and honest way.",
                "examples": [
                    "I'm sure the deal was completely above board as I know James well and he'd never do anything illegal or corrupt.",
                    "The minister claimed all the appointments were above board and denied claims that some positions had been given to his friends."
                ]
            },
            {
                "idiom": "above the law",
                "meaning": "If someone is above the law, they are not subject to the laws of a society.",
                "examples": [
                    "Just because his father is a rich and powerful man, he seems to think he's above the law and he can do whatever he likes.",
                    "In a democracy, no-one is above the law - not even a president or a prime-minister."
                ]
            },
            {
                "idiom": "Achilles' heel",
                "meaning": "An Achilles' heel is a weakness that could result in failure.",
                "examples": [
                    "He's a good golfer, but his Achilles' heel is his putting and it's often made him lose matches.",
                    "The country's dependence on imported oil could prove to be its Achilles' heel if prices keep on rising."
                ]
            },
            {
                "idiom": "across the board",
                "meaning": "If something is across the board, it relates to all without exception.",
                "examples": [
                    "The company has promised to increase salaries across the board, so everyone will get a pay rise.",
                    "The tax cuts will only apply to low and middle-income families, so they won't be across the board."
                ]
            },
            {
                "idiom": "add fuel to the fire",
                "meaning": "If you add fuel to the fire, you do something to make a bad situation even worse.",
                "examples": [
                    "People are already unhappy, and if the government allows oil prices to increase it'll just be adding fuel to the fire.",
                    "If Billy's angry, don't say anything. You'll just be  adding fuel to the fire."
                ]
            },
            {
                "idiom": "add insult to injury",
                "meaning": "Someone adds insult to injury if they say or do something to upset you a second time, after you've already been upset somehow.",
                "examples": [
                    "He said my clothes didn't suit me, and then to add insult to injury he said I needed to lose some weight!",
                    "The bank took back my car, and then added insult to injury by cancelling my credit cards!"
                ]
            },
            {
                "idiom": "against all odds | against all the odds",
                "meaning": "If you do something against all odds, or against all the odds, you do it even though there were many problems and it didn't seem possible to do.",
                "examples": [
                    "He had a serious accident and was close to death  but, against all odds, he recovered and now he's fine.",
                    "No-one thought we could do it but, against all the odds, we won the Olympic gold medal."
                ]
            },
            {
                "idiom": "agree to differ | agree to disagree",
                "meaning": "If two people agree to differ, or agree to disagree, they accept that they have different opinions about something and stop trying to change each other's opinion.",
                "examples": [
                    "We're never going to think the same way about politics, so let's just agree to differ and leave it at that.",
                    "Why don't they just agree to disagree instead of arguing about it all the time?"
                ]
            },
            {
                "idiom": "ahead of the game",
                "meaning": "You are ahead of the game if you have an advantage over your competitors in any activity in which you try to do better than others, such as in business, academia, sports, etc.",
                "examples": [
                    "We got ahead of the game by employing the best people in our research laboratories.",
                    "You'll be ahead of the game when you start at university if you do a lot of preparation before the term begins."
                ]
            },
            {
                "idiom": "all hell broke loose",
                "meaning": "You can say \"all hell broke loose\" if a situation suddenly became violent or chaotic.",
                "examples": [
                    "I was walking through the station on my way to work when I heard this huge explosion, and then all hell broke loose.",
                    "Everything was fine in the club until someone yelled, \"Fire!\" and then all hell broke loose as people started running and screaming and pushing each other."
                ]
            },
            {
                "idiom": "all the rage",
                "meaning": "If something is all the rage, it's very popular or it's in fashion at the moment.",
                "examples": [
                    "Can you remember when disco was all the rage and we'd go dancing all night in the clubs?",
                    "When Hans was a kid, skate boards were all the rage."
                ]
            },
            {
                "idiom": "an acid test",
                "meaning": "An acid test is something that shows the true worth or value of something or someone.",
                "examples": [
                    "Our new player has been doing well at training and in practice matches, but the acid test will come in her first real match.",
                    "The new political party is doing better and better in the polls, but the acid test will be the next election."
                ]
            },
            {
                "idiom": "an act of God",
                "meaning": "Something like an earthquake or a tornado can be called an act of God.",
                "examples": [
                    "Will your insurance policy pay for the cost of replacing your house if it's destroyed by an act of God?",
                    "My daughter said that if disasters that kill lots of people are acts of God, why does He do it. I didn't know what to say."
                ]
            },
            {
                "idiom": "an ax to grind (1)",
                "meaning": "If you have an ax to grind with someone, you have a problem with them, or a complaint against them, which you'd like to discuss.",
                "examples": [
                    "I have an ax to grind with Mitch. He owes me money and he's been avoiding me.",
                    "If Larry has an ax to grind with someone, and he meets them after he's been drinking, he can get violent."
                ]
            },
            {
                "idiom": "an axe to grind (2)",
                "meaning": "If you have an axe to grind, you have a strong opinion about something and you express this opinion whenever you can.",
                "examples": [
                    "Billy's had this axe to grind about globalisation recently and he's always going on about it.",
                    "These people always seem to have an axe to grind and whenever someone interviews them they see it as a chance to push their ideas."
                ]
            },
            {
                "idiom": "another string to your bow",
                "meaning": "If you have another string to your bow, you have another way of making a living.",
                "examples": [
                    "Lots of people learn to teach English so they'll have another string to their bow.",
                    "I've lost my job and I'll have to retrain for something else. I wish I already had another string to my bow."
                ]
            },
            {
                "idiom": "answer the call of nature",
                "meaning": "If you answer the call of nature, you go to the toilet.",
                "examples": [
                    "Could we stop somewhere? I need to answer the call of nature.",
                    "Does anyone need to answer the call of nature before we set off?"
                ]
            },
            {
                "idiom": "around the clock",
                "meaning": "If something occurs around the clock, it goes on all day and all night.",
                "examples": [
                    "I have to finish this report by Tuesday, so I'll be working around the clock until I get it done.",
                    "What the young people of this town need is a drop-in centre that's open around the clock."
                ]
            },
            {
                "idiom": "as soon as possible | asap",
                "meaning": "If you do something as soon as possible (sometimes abbreviated to \"asap\"), you do it at the first possible opportunity.",
                "examples": [
                    "She said she'll be here as soon as possible, so there's no point calling her again. She's coming as quickly as she can.",
                    "I'm in a meeting now, but I'll call you back asap."
                ]
            },
            {
                "idiom": "asking for trouble",
                "meaning": "If someone is asking for trouble, they're doing something risky that could lead to a problem.",
                "examples": [
                    "Don't you think that working all day and then partying all night is asking for trouble?",
                    "Running fast without warming up properly is asking for trouble, and could easily cause a muscle strain."
                ]
            },
            {
                "idiom": "at a loose end",
                "meaning": "If you're at a loose end, you have nothing to do.",
                "examples": [
                    "If I'm ever at a loose end, I look for a good book to read.",
                    "Give me a call if you're at a loose end and we'll go and do something."
                ]
            },
            {
                "idiom": "at cross-purposes",
                "meaning": "If you're at cross-purposes with someone, you think you're both talking about the same thing but you're actually talking about different things.",
                "examples": [
                    "I was talking to Kyle about Georgia, but we were at cross-purposes. I was talking about Georgia in Russia, and he was talking about Georgia in the U.S.A. We laughed when we realised we were talking about two different \"Georgias\".",
                    "Jill and I were at cross-purposes today when we were talking about John. I was talking about John Smith, my neighbour, but she thought I was talking John at work!"
                ]
            },
            {
                "idiom": "at loose ends",
                "meaning": "If you're at loose ends, you feel restless and unsettled because you don't have anything to do.",
                "examples": [
                    "Hank's been at loose ends since he lost his job, so I hope he finds another one soon.",
                    "We tried limiting the time Jimmy could play computer games, but he gets restless and moody whenever he's at loose ends, so we let him play."
                ]
            },
            {
                "idiom": "at sea | all at sea",
                "meaning": "If you're at sea, or all at sea, you're confused about something and not sure what to do.",
                "examples": [
                    "I'm all at sea with our new spreadsheet software. I just can't understand it.",
                    "For the first few days in her new job, Gail felt totally at sea. She didn't know what to do or who to ask for help."
                ]
            },
            {
                "idiom": "at the drop of a hat",
                "meaning": "If you do something at the drop of a hat, you do it immediately, without preparation or planning.",
                "examples": [
                    "I'd quit my job at the drop of a hat if I didn't have a family to support.",
                    "Lee: You can't just go running off to some beach resort at the drop of a hat whenever you feel like  it. Kim: Why not?"
                ]
            },
            {
                "idiom": "at your wits' end",
                "meaning": "If you're at your wits' end, you're upset and frustrated because you've tried everything you can think of to solve a problem, and nothing has worked.",
                "examples": [
                    "I'm at my wits' end! I've been trying to solve a problem with some software all morning and I still haven't got it to work!",
                    "Kelvin says he's been trying to get tickets for the game all day, but he's at his wits' end. Nobody's got any left."
                ]
            }
        ]
    },
    {
        "B": [
            {
                "idiom": "(your) bread and butter",
                "meaning": "Your bread and butter is your livelihood or the source of your income.",
                "examples": [
                    "Bartending is my bread and butter at the moment, but I'm trying to get into acting.",
                    "The conditions are bad, but this work is their bread and butter so make sure the workers have other jobs before you close down the factory."
                ]
            },
            {
                "idiom": "a bad hair day",
                "meaning": "If you're having a bad hair day, everything seems to be going wrong for you.",
                "examples": [
                    "Poor Sue's in a terrible mood. I think she's having a bad hair day.",
                    "I knew it was going to be a bad hair day when my car wouldn't start."
                ]
            },
            {
                "idiom": "a bag of tricks",
                "meaning": "Someone's bag of tricks is their collection of techniques or methods for getting a job done or for achieving a goal.",
                "examples": [
                    "I wonder what the Democrats will pull out of their bag of tricks to win the election this time.",
                    "Most English teachers are always looking for new games and activities to add to their bag of tricks."
                ]
            },
            {
                "idiom": "a ballpark figure | a ballpark estimate",
                "meaning": "If you give a ballpark figure or a ballpark estimate, you give a number which you think is fairly close to the actual one.",
                "examples": [
                    "We don't know the exact cost, but a ballpark figure would be around six million dollars.",
                    "I know you can't tell me exactly when it'll be finished, but can you give me a ballpark estimate?"
                ]
            },
            {
                "idiom": "a blessing in disguise",
                "meaning": "You can say something is a blessing in disguise if it appears to be bad at first, but it results in something very good in the end.",
                "examples": [
                    "Being caught in that traffic jam was a blessing in disguise. If I hadn't missed the flight, I would have been on that plane when it crashed.",
                    "His accident was a blessing in disguise because it gave him lots of time to think about his life while he was recovering, and as a result he made some important changes that improved his life."
                ]
            },
            {
                "idiom": "back to square one",
                "meaning": "If you have to go back to square one, you have to stop and start again, usually because something isn't working as well as expected.",
                "examples": [
                    "We were going to start the new company next month, but it's back to square one now that Omar has changed his mind about investing in it.",
                    "After they lost the election, the Liberal Party had to go back to square one and come up with some new policies and some new ideas."
                ]
            },
            {
                "idiom": "back to the drawing board",
                "meaning": "You can say \"back to the drawing board\" when a plan or a design has failed, and you decide to begin all over again.",
                "examples": [
                    "Their plans to open a hotel in Fiji fell through, so it was back to the drawing board.",
                    "Our new drug worked on rats, but when it was tried on people it failed, so we had to go back to the drawing board and start again."
                ]
            },
            {
                "idiom": "backed into a corner",
                "meaning": "If you're backed into a corner, you're in a difficult situation that will be hard to get out of.",
                "examples": [
                    "When his business failed, Gerry felt he'd been backed into a corner and he didn't know what he could do.",
                    "Jimmy's drug addiction had backed him into a corner and his only way out was to go into rehab and kick the habit."
                ]
            },
            {
                "idiom": "bark up the wrong tree",
                "meaning": "If you're barking up the wrong tree, you're looking for something in the wrong place or going about something in the wrong way.",
                "examples": [
                    "The police think the drugs are being brought in by the mafia, but they're barking up the wrong tree. They should be looking much closer to home.",
                    "She's barking up the wrong tree if she's interested in Gavin. Doesn't she know he's gay?"
                ]
            },
            {
                "idiom": "bear the brunt",
                "meaning": "If you bear the brunt of something, you suffer the worst of its impact or its effects.",
                "examples": [
                    "The driver bore the brunt of the crash because he was right at the front of the bus.",
                    "The team's coach bore the brunt of the criticism because he'd selected the players who'd performed so badly."
                ]
            },
            {
                "idiom": "beat around the bush | beat about the bush",
                "meaning": "If you beat around the bush, or beat about the bush, you don't say something directly, usually because you don't want to upset the person you're talking to.",
                "examples": [
                    "I had trouble telling Pedro he'd lost his job. I started beating around the bush and talking about one door closing and another door opening.",
                    "Stop beating about the bush. Just tell me what's happened!"
                ]
            },
            {
                "idiom": "beat the rap",
                "meaning": "If someone beats the rap, they avoid being found guilty of a crime.",
                "examples": [
                    "Everyone knows that Jimmy the Snitch did the robbery in Green St., but he beat the rap because he's in with the cops.",
                    "Henry was charged with drunk driving, but his lawyer helped him beat the rap on some technical detail."
                ]
            },
            {
                "idiom": "behind someone's back",
                "meaning": "If you do something behind someone's back, you do it without letting them know about it.",
                "examples": [
                    "We've taught our kids that it's impolite to talk about people behind their backs.",
                    "The nurses had to go behind the doctor's back when they reported him for drinking alcohol before doing operations."
                ]
            },
            {
                "idiom": "behind the eight ball",
                "meaning": "If you're behind the eight ball, you're in a difficult or dangerous position.",
                "examples": [
                    "The economic recession has really put our new business behind the eight ball. Nobody's spending money.",
                    "Carlo is behind the eight ball now because his final exam is in two days and he still hasn't started studying for it."
                ]
            },
            {
                "idiom": "behind the times",
                "meaning": "If someone is behind the times, they are old-fashioned and their ideas  are out of date.",
                "examples": [
                    "How can we be a successful company if our executives are so behind the times that they don't know what people want these days?",
                    "Neil is really behind the times. He doesn't even know what rap music sounds like!"
                ]
            },
            {
                "idiom": "beside the point",
                "meaning": "You can say something is beside the point if it has nothing to do with what's being talked about or with the reason something is being done.",
                "examples": [
                    "What older people think of the product is beside the point. We are marketing to young people, so the only thing that matters is what they think.",
                    "I eat this food because it's good for me, so whether it's delicious or not is beside the point."
                ]
            },
            {
                "idiom": "beyond a shadow of a doubt",
                "meaning": "Something is true \"beyond a shadow of a doubt\" if there is no possibility at all that it isn't true.",
                "examples": [
                    "Are you absolutely sure, beyond a shadow of a doubt, that he is guilty of the crime?",
                    "A few years ago a great many scientists said they were sure, beyond a shadow of a doubt, that there was no such thing as global warming. Were they right?"
                ]
            },
            {
                "idiom": "bite your tongue | hold your tongue",
                "meaning": "If you bite your tongue, or hold your tongue, you force yourself not to say something you really want to say.",
                "examples": [
                    "I wanted to tell Carlos he was being stupid, but I bit my tongue and just sat there.",
                    "You're going to have to learn to hold your tongue instead of saying whatever comes into your head."
                ]
            },
            {
                "idiom": "blow your own horn | blow your own trumpet",
                "meaning": "If you blow your own horn, or blow your own trumpet, you proudly boast about your own talents and successes.",
                "examples": [
                    "I hate the way Barry always blows his own horn, and I get sick of hearing about all the amazing things he's done.",
                    "Lorraine says that if you want to be successful in the fashion business, you really have to blow your own trumpet."
                ]
            },
            {
                "idiom": "break the ice",
                "meaning": "If you break the ice you say or do something to create a more relaxed atmosphere when meeting people for the first time.",
                "examples": [
                    "What do you do in a new class to help break the ice and get students talking?",
                    "Knowing how to break the ice is one of those social skills that will come with experience and maturity."
                ]
            },
            {
                "idiom": "break your heart",
                "meaning": "If someone breaks your heart, they cause you a lot of emotional pain by ending a romantic relationship, or by deeply hurting you in some other way.",
                "examples": [
                    "I loved Monty, and he broke my heart when he left me and went off with someone else.",
                    "Sue says her heart has been broken too many times, and she won't let herself fall in love again."
                ]
            },
            {
                "idiom": "burn your bridges | burn your boats",
                "meaning": "You have burned your bridges, or burned your boats, if you were in a situation and you then left it after doing something that made it impossible to go back there.",
                "examples": [
                    "If you insult the boss when you leave, you'll be burning your bridges and you'll never be able to go back to work there again.",
                    "I knew I'd be burning my boats if I dropped out of school, but I didn't care because I was determined to be a photographer."
                ]
            },
            {
                "idiom": "by the book",
                "meaning": "If you do something by the book, you do it strictly according to the rules or the official procedures.",
                "examples": [
                    "The match officials in the golf tournament acted strictly by the book when they disqualified a player for marking down the wrong score on his score card.",
                    "The embassy officials process visa applications by the book these days, so it's harder to get one than it was when they weren't so strict."
                ]
            },
            {
                "idiom": "by word of mouth",
                "meaning": "If something becomes well-known by word of mouth, it becomes well-known because people are telling each other about it, and not because of advertising or other marketing tools.",
                "examples": [
                    "Word of mouth made this movie a hit. A few people saw it and told their friends about it, and then they told more people about it, and before long everyone was going to see it.",
                    "The best possible marketing tool is word of mouth, but a product has to be extremely good to earn it."
                ]
            },
            {
                "idiom": "the back of beyond | the back of the beyond",
                "meaning": "You can say a place is in the back of beyond, or the back of the beyond, if it's very far from towns or cities.",
                "examples": [
                    "Why do you want to live way out in the desert? It's in the back of beyond.",
                    "Ivan went to visit his cousins in a tiny village in the back of the beyond. It took him a long time to get there."
                ]
            },
            {
                "idiom": "the ball's in your court",
                "meaning": "If someone you're negotiating with says \"the ball's in your court\", they think it's your turn to make a move or make an offer.",
                "examples": [
                    "We've offered him ten thousand dollars a month, so the ball's in his court now.",
                    "They know our position, so the ball's in their court. If they want to pursue the matter, they'll have to make the next move."
                ]
            }
        ]
    }
]